# Ensemble DAG: image → PARSeq → LayoutLMv3 → KIE JSON
# Populated in Session 7 with Python pre/post-processing backends.
name: "ensemble_kie"
platform: "ensemble"
max_batch_size: 8
input [
  { name: "image", data_type: TYPE_UINT8, dims: [-1, -1, 3] }
]
output [
  { name: "kie_json", data_type: TYPE_STRING, dims: [1] }
]
ensemble_scheduling {
  # step: preprocess_python → parseq → align_bbox_python → layoutlmv3 → decode_python
  # (filled in S7)
}
